In [1]:
import sqlalchemy as db
from getpass import getpass

In [2]:
password = getpass("Mysql Password: ")

Mysql Password: ········

In [3]:
dbName = "publications"
connectionData = f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [4]:
engine = db.create_engine(connectionData)
print("Connected to server!")

Connected to server!

In [5]:
import pandas as pd

## Challenge 1

In [6]:
df = pd.read_sql_query("""
SELECT 
	a.au_id "AUTHOR ID", 
    a.au_lname "LAST NAME", 
    a.au_fname "FIRST NAME", 
    t.title "TITLE",
    p.pub_name "PUBLISHER"
FROM authors AS a
INNER JOIN titleauthor AS ta ON a.au_id=ta.au_id
INNER JOIN titles AS t ON ta.title_id=t.title_id
INNER JOIN publishers AS p ON t.pub_id=p.pub_id
""", engine)

In [7]:
df.head(10)

,AUTHOR ID,LAST NAME,FIRST NAME,TITLE,PUBLISHER
0,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
5,274-80-9391,Straight,Dean,Straight Talk About Computers,Algodata Infosystems
6,712-45-1867,del Castillo,Innes,Silicon Valley Gastronomic Treats,Binnet & Hardley
7,722-51-5454,DeFrance,Michel,The Gourmet Microwave,Binnet & Hardley
8,899-46-2035,Ringer,Anne,The Gourmet Microwave,Binnet & Hardley
9,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems

## Challenge 2

In [8]:
df = pd.read_sql_query("""
SELECT 
	a.au_id "AUTHOR ID", 
    a.au_lname "LAST NAME", 
    a.au_fname "FIRST NAME", 
    p.pub_name "PUBLISHER",
    COUNT(*) AS "TITTLE COUNT"
	FROM authors AS a
	INNER JOIN titleauthor AS ta ON a.au_id=ta.au_id
	INNER JOIN titles AS t ON ta.title_id=t.title_id
	INNER JOIN publishers AS p ON t.pub_id=p.pub_id
	GROUP BY a.au_id, a.au_lname, a.au_fname, p.pub_name
""", engine)

In [9]:
df.head(10)

     AUTHOR ID     LAST NAME FIRST NAME         PUBLISHER  TITTLE COUNT
0  213-46-8915         Green   Marjorie    New Moon Books             1
1  899-46-2035        Ringer       Anne    New Moon Books             1
2  998-72-3567        Ringer     Albert    New Moon Books             2
3  172-32-1176         White    Johnson    New Moon Books             1
4  486-29-1786      Locksley   Charlene    New Moon Books             1
5  712-45-1867  del Castillo      Innes  Binnet & Hardley             1
6  722-51-5454      DeFrance     Michel  Binnet & Hardley             1
7  899-46-2035        Ringer       Anne  Binnet & Hardley             1
8  724-80-9391    MacFeather    Stearns  Binnet & Hardley             1
9  756-30-7391        Karsen      Livia  Binnet & Hardley             1

## Challenge 3